input_files/C2-low_pressure_gradient-8%_mineral_proportion/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     passiveScalarPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8640000.0; //250000.0;

deltaT          5.0E-1;

writeControl    adjustableRunTime;

writeInterval   172800; //10000.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo         50000000000.0;

maxDeltaT     250;

// ************************************************************************* //
