input_files/C2-low_pressure_gradient-8%_mineral_proportion/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0E-4;

boundaryField
{
    west_surface
    {
        type            fixedValue;
	value uniform 10.0;
    }

    east_surface
    {
        type            zeroGradient;
    }

    north_surface
    {
        type            zeroGradient;
    }

    south_surface
    {
        type            zeroGradient;
    }
    top_surface
    {
        type            zeroGradient;
    }

    bottom_surface
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
